Revit 2027 API
ParameterTypeId.RoofSlope Property
 "Slope"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoofSlope { get; }
Public Shared ReadOnly Property RoofSlope As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoofSlope {
	ForgeTypeId^ get ();
}
static member RoofSlope : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace